


using doNetLearn.Expressions;



ExpressionsMethod expressionsMethod =new ExpressionsMethod();
expressionsMethod.Execute();




    //源代码生成器
    //一、源代码生成器项目得创建和调试
    //1.创建
    //2.调试

    //二、Roslyn得语法树结构

    //三、编码技巧和必备套路
    ////1.如何获得命名空间和类名，举一反三
    ////2.源代码生成器得开发场景得解决目的
    
    //四、可以用来做什么？
    //    1、MVVM下VM层属性得编码简化
    //    2、常规依赖注入下构造函数得自动生成
    //    3、源代码生成异步方法
    //    4、生成方法专属得异常
    //    5、将类型得属性提取出来生成对应得枚举和字符串数组
    //    6、改写方法灵活签入日志
    //    7、改写方法自动try catch





    //知识点：
    //1源生成器项目需要使用.NET Standard 2.0
    //2需要在引入得包里面手动改项目配置
    //3Syntax Visualizer很好用
    //4配置调试得时候需要把原来得预设删掉，要不然会出问题
    //5源生成器生成的东西是改不了的，但是你可以提取出来
    //6特性是一个非常好的机制，不论是反射还是源代码生成器
    //7在想这么自动化生产之前，当然要自己手动试一遍
    {

       // Syntax Visualizer



        //源生成器

        //未保存的时候

        //增量生成器
    }


